Repository: tz-thantzin/portfolio
Catalog: lib/l10n/app_*.arb
Languages: th

source: Hi!
th: สวัสดี!

# i_am
source: I'm
th: ฉันคือ

source: Home
th: หน้าหลัก

source: About
th: เกี่ยวกับ

# work_experience
source: Experience
th: ประสบการณ์ทำงาน

# skill
source: Skills
th: ทักษะ

source: Follow Me
th: ติดตามฉัน

# download_resume
source: Resume
th: ดาวน์โหลดเรซูเม่

source: About Me
th: เกี่ยวกับฉัน

# about_me_description
source: I am an experienced mobile application developer with over 11 years of expertise in Flutter and iOS development. Throughout my career, I have successfully led teams in delivering high-quality, user-friendly applications. I enjoy tackling complex technical challenges and mentoring team members to help them reach their full potential. My focus is on creating elegant, performant, and maintainable apps that provide exceptional user experiences. I graduated from the University of Computer Studies, Yangon, in November 2013. I started my career in February 2014 as an OJT and became a permanent full-time staff member in May 2014. In January 2019, I traveled to Tokyo, Japan, for professional training and returned on February 1, 2019. I went again in May 2019 for one month to attend additional technology training and learn about Japanese work culture.
th: ฉันเป็นนักพัฒนาแอปมือถือที่มีประสบการณ์มากกว่า 11 ปีใน Flutter และ iOS ตลอดอาชีพการทำงาน ฉันได้เป็นผู้นำทีมและส่งมอบแอปพลิเคชันที่มีคุณภาพสูงและใช้งานง่าย ฉันชอบแก้ไขปัญหาทางเทคนิคที่ซับซ้อนและให้คำปรึกษาแก่สมาชิกในทีมเพื่อให้พวกเขาบรรลุศักยภาพสูงสุด โฟกัสของฉันคือการสร้างแอปที่สวยงาม มีประสิทธิภาพ และง่ายต่อการดูแลรักษา

# technologies
source: Technologies I have worked with:
th: เทคโนโลยีที่เคยใช้งาน:

source: Programming Languages & Tools
th: ภาษาโปรแกรม & เครื่องมือ

# workflows_title
source: Workflows
th: เวิร์กโฟลว์

# workflows
source: Responsive Design|Cross Functional Teams|Waterfall Development|Agile Development & Scrum|Team Leading & Task Delegation|Conducting code reviews and sprint planning
th: การออกแบบตอบสนอง|ทีมข้ามหน้าที่|การพัฒนาแบบ Waterfall|การพัฒนาแบบ Agile & Scrum|การนำทีม & การมอบหมายงาน|การตรวจสอบโค้ดและการวางแผนสปรินต์

# freelance_title
source: Freelance Mobile Application Developer
th: นักพัฒนาแอปพลิเคชันมือถืออิสระ

# freelance_period
source: Apr 2024 – Present
th: เม.ย. 2024 – ปัจจุบัน

# mobile_lead_title
source: Mobile Team Lead
th: หัวหน้าทีมพัฒนาโมบาย

# mobile_lead_company
source: TechFun Myanmar Co., Ltd., Yangon
th: TechFun Myanmar Co., Ltd., ย่างกุ้ง

# mobile_lead_period
source: Nov 2019 – Mar 2024
th: พ.ย. 2019 – มี.ค. 2024

# senior_dev_title
source: Senior Mobile Application Developer
th: นักพัฒนาแอปพลิเคชันมือถืออาวุโส

# senior_dev_company
source: TechFun Myanmar Co., Ltd., Yangon
th: TechFun Myanmar Co., Ltd., ย่างกุ้ง

# senior_dev_period
source: Nov 2017 – Oct 2019
th: พ.ย. 2017 – ต.ค. 2019

# research_leader_title
source: Researching Leader
th: หัวหน้าฝ่ายวิจัย

# research_leader_company
source: Acroquest Myanmar Technology Co., Ltd., Yangon
th: Acroquest Myanmar Technology Co., Ltd., ย่างกุ้ง

# research_leader_period
source: Oct 2015 – Dec 2015
th: ต.ค. 2015 – ธ.ค. 2015

# software_engineer_title
source: Software Engineer
th: วิศวกรซอฟต์แวร์

# software_engineer_company
source: Acroquest Myanmar Technology Co., Ltd., Yangon
th: Acroquest Myanmar Technology Co., Ltd., ย่างกุ้ง

# software_engineer_period
source: May 2014 – Sep 2015
th: พ.ค. 2014 – ก.ย. 2015
